In [1]:
import pandas as pd
import numpy as np

In [2]:
!ls data/

census_income_learn.csv census_income_test.csv

In [3]:
!ls sup_info/

census_income_additional_info.pdf data_cols.csv
census_income_metadata.txt        data_cols.numbers

## Import data

In [4]:
col_info = pd.read_csv(filepath_or_buffer="sup_info/data_cols.csv")

In [5]:
learn = pd.read_csv(filepath_or_buffer="data/census_income_learn.csv", header=None)
learn.columns = col_info["col_name"].str.lower().values
print(learn.shape)
learn.head()

(199523, 42)

,age,wkr_class,ind_code,occ_code,edu,wage_hr,enroll_edu,marital_stat,major_ind_code,major_occ_code,...,mother_country,self_country,citizen,own_biz_self_empl,veteran_quest,veteran_benefits,weeks_worked_year,year,??,income_target
0,73,Not in universe,0,0,High school graduate,0,Not in universe,Widowed,Not in universe or children,Not in universe,...,United-States,United-States,United-States,Native- Born in the United States,0,Not in universe,2,0,95,- 50000.
1,58,Self-employed-not incorporated,4,34,Some college but no degree,0,Not in universe,Divorced,Construction,Precision production craft & repair,...,United-States,United-States,United-States,Native- Born in the United States,0,Not in universe,2,52,94,- 50000.
2,18,Not in universe,0,0,10th grade,0,High school,Never married,Not in universe or children,Not in universe,...,Vietnam,Vietnam,Vietnam,Foreign born- Not a citizen of U S,0,Not in universe,2,0,95,- 50000.
3,9,Not in universe,0,0,Children,0,Not in universe,Never married,Not in universe or children,Not in universe,...,United-States,United-States,United-States,Native- Born in the United States,0,Not in universe,0,0,94,- 50000.
4,10,Not in universe,0,0,Children,0,Not in universe,Never married,Not in universe or children,Not in universe,...,United-States,United-States,United-States,Native- Born in the United States,0,Not in universe,0,0,94,- 50000.

## Explore data

In [6]:
learn.describe()

,age,ind_code,occ_code,wage_hr,capital_gains,capital_losses,stock_divs,mc_dmsa,fm_under_18,veteran_quest,weeks_worked_year,year,??
count,199523.000000,199523.000000,199523.000000,199523.000000,199523.00000,199523.000000,199523.000000,199523.000000,199523.000000,199523.000000,199523.000000,199523.000000,199523.000000
mean,34.494199,15.352320,11.306556,55.426908,434.71899,37.313788,197.529533,1740.380269,1.956180,0.175438,1.514833,23.174897,94.499672
std,22.310895,18.067129,14.454204,274.896454,4697.53128,271.896428,1984.163658,993.768156,2.365126,0.553694,0.851473,24.411488,0.500001
min,0.000000,0.000000,0.000000,0.000000,0.00000,0.000000,0.000000,37.870000,0.000000,0.000000,0.000000,0.000000,94.000000
25%,15.000000,0.000000,0.000000,0.000000,0.00000,0.000000,0.000000,1061.615000,0.000000,0.000000,2.000000,0.000000,94.000000
50%,33.000000,0.000000,0.000000,0.000000,0.00000,0.000000,0.000000,1618.310000,1.000000,0.000000,2.000000,8.000000,94.000000
75%,50.000000,33.000000,26.000000,0.000000,0.00000,0.000000,0.000000,2188.610000,4.000000,0.000000,2.000000,52.000000,95.000000
max,90.000000,51.000000,46.000000,9999.000000,99999.00000,4608.000000,99999.000000,18656.300000,6.000000,2.000000,2.000000,52.000000,95.000000

In [7]:
learn.isna().sum()

age                  0
wkr_class            0
ind_code             0
occ_code             0
edu                  0
wage_hr              0
enroll_edu           0
marital_stat         0
major_ind_code       0
major_occ_code       0
race                 0
hispanic_org         0
sex                  0
labor_union          0
unemp_reason         0
employ_stat          0
capital_gains        0
capital_losses       0
stock_divs           0
tax_filer_stat       0
prev_res_region      0
prev_res_state       0
hh_fm_stat           0
hh_summary           0
mc_dmsa              0
mc_dreg              0
mc_mvreg             0
in_house_1yr         0
prev_res_sunbelt     0
num_worker           0
fm_under_18          0
father_country       0
mother_country       0
self_country         0
citizen              0
own_biz_self_empl    0
veteran_quest        0
veteran_benefits     0
weeks_worked_year    0
year                 0
??                   0
income_target        0
dtype: int64

In [8]:
learn.nunique()

age                     91
wkr_class                9
ind_code                52
occ_code                47
edu                     17
wage_hr               1240
enroll_edu               3
marital_stat             7
major_ind_code          24
major_occ_code          15
race                     5
hispanic_org            10
sex                      2
labor_union              3
unemp_reason             6
employ_stat              8
capital_gains          132
capital_losses         113
stock_divs            1478
tax_filer_stat           6
prev_res_region          6
prev_res_state          51
hh_fm_stat              38
hh_summary               8
mc_dmsa              99800
mc_dreg                 10
mc_mvreg                 9
in_house_1yr            10
prev_res_sunbelt         3
num_worker               4
fm_under_18              7
father_country           5
mother_country          43
self_country            43
citizen                 43
own_biz_self_empl        5
veteran_quest            3
veteran_benefits         3
weeks_worked_year        3
year                    53
??                       2
income_target            2
dtype: int64

In [9]:
learn.duplicated().sum()

np.int64(3229)

In [10]:
learn.columns

Index(['age', 'wkr_class', 'ind_code', 'occ_code', 'edu', 'wage_hr',
       'enroll_edu', 'marital_stat', 'major_ind_code', 'major_occ_code',
       'race', 'hispanic_org', 'sex', 'labor_union', 'unemp_reason',
       'employ_stat', 'capital_gains', 'capital_losses', 'stock_divs',
       'tax_filer_stat', 'prev_res_region', 'prev_res_state', 'hh_fm_stat',
       'hh_summary', 'mc_dmsa', 'mc_dreg', 'mc_mvreg', 'in_house_1yr',
       'prev_res_sunbelt', 'num_worker', 'fm_under_18', 'father_country',
       'mother_country', 'self_country', 'citizen', 'own_biz_self_empl',
       'veteran_quest', 'veteran_benefits', 'weeks_worked_year', 'year', '??',
       'income_target'],
      dtype='object')

In [11]:
learn.head()

,age,wkr_class,ind_code,occ_code,edu,wage_hr,enroll_edu,marital_stat,major_ind_code,major_occ_code,...,mother_country,self_country,citizen,own_biz_self_empl,veteran_quest,veteran_benefits,weeks_worked_year,year,??,income_target
0,73,Not in universe,0,0,High school graduate,0,Not in universe,Widowed,Not in universe or children,Not in universe,...,United-States,United-States,United-States,Native- Born in the United States,0,Not in universe,2,0,95,- 50000.
1,58,Self-employed-not incorporated,4,34,Some college but no degree,0,Not in universe,Divorced,Construction,Precision production craft & repair,...,United-States,United-States,United-States,Native- Born in the United States,0,Not in universe,2,52,94,- 50000.
2,18,Not in universe,0,0,10th grade,0,High school,Never married,Not in universe or children,Not in universe,...,Vietnam,Vietnam,Vietnam,Foreign born- Not a citizen of U S,0,Not in universe,2,0,95,- 50000.
3,9,Not in universe,0,0,Children,0,Not in universe,Never married,Not in universe or children,Not in universe,...,United-States,United-States,United-States,Native- Born in the United States,0,Not in universe,0,0,94,- 50000.
4,10,Not in universe,0,0,Children,0,Not in universe,Never married,Not in universe or children,Not in universe,...,United-States,United-States,United-States,Native- Born in the United States,0,Not in universe,0,0,94,- 50000.

In [12]:
learn["edu"].value_counts()

edu
High school graduate                      48407
Children                                  47422
Some college but no degree                27820
Bachelors degree(BA AB BS)                19865
7th and 8th grade                          8007
10th grade                                 7557
11th grade                                 6876
Masters degree(MA MS MEng MEd MSW MBA)     6541
9th grade                                  6230
Associates degree-occup /vocational        5358
Associates degree-academic program         4363
5th or 6th grade                           3277
12th grade no diploma                      2126
1st 2nd 3rd or 4th grade                   1799
Prof school degree (MD DDS DVM LLB JD)     1793
Doctorate degree(PhD EdD)                  1263
Less than 1st grade                         819
Name: count, dtype: int64